In [1]:
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn
from sklearn.linear_model import LinearRegression
import matplotlib.pyplot as plt
import numpy as np
import sklearn.linear_model
import FinanceDataReader as fdr
from datetime import datetime, timedelta
%matplotlib inline

In [2]:
industry = pd.read_csv("./datas/SYMB_Industry.csv")
industry.head()

            Industry  IndustryCode
0  건설 장비 및대형차, 기차, 배        521020
1            다양한 소매업        533010
2              레저 상품        532050
3           미디어 및 출판        533020
4       반도체 및 반도체 장비        571010

# Symbol 리스트

In [3]:
indX = pd.read_csv("datas/industry_code.csv")
df_3 = indX.drop(['Unnamed: 0'], axis=1)
df_3.tail()

,Symbol,Name,Industry,IndustryCode
7210,RHE,Regional Health Properties Inc,부동산 운영 관리,601010.0
7211,BTX,Brooklyn Immunotherapeutics Inc,미디어 및 출판,533020.0
7212,PW PR A,Power REIT PRF,주택 및 상업용 리츠,601020.0
7213,IPB,Merrill LYNCH Depositor Inc Indexplus Trust Se...,은행,551010.0
7214,VHAQ RT,Viveon Health Acquisition Corp,기타 금융업,556010.0

# 전쟁 리스트

In [4]:
ls_war = pd.read_excel("datas/ls_war.xls", "sheet")
ls_war = ls_war.drop(["Unnamed: 0","전쟁수"], axis=1)
ls_war
#ls_war = ls_war.drop(["Unnamed: 0", "종료시점", "위치"], axis=1)

         발발시점             갈등이름 갈등종류     전쟁규모  참전국수
0  2001-09-11           테러와의전쟁   테러  1000000    48
1  2002-01-15      영원한자유작전-필리핀   테러   115800     2
2  2002-10-07   영원한자유작전-아프리카의뿔   테러   500000    38
3  2003-03-20            이라크전쟁   테러  1000000    41
4  2004-04-01        이란-PJAK충돌   민족    17000     3
5  2004-04-18    예멘의 Houthi 반란   내란    32000     7
6  2005-08-27        파라과이인민군반란   내란     3650     3
7  2006-01-25        파타-하마스 분쟁   테러    55000     3
8  2006-06-12       2006년레바논전쟁   테러    10500     2
9  2006-02-22            이라크내전   내란   748000     5
10 2006-12-11          멕시코마약전쟁   마약   360000     4
11 2006-12-30           소말리아전쟁   해적    35250     8
12 2007-02-06   영원한자유작전-트랜스사하라   테러     5325    17
13 2008-03-25       2008 안주안침공   내란     2500     7
14 2009-07-26           보코하람반란   내란    10000    19
15 2009-01-31           소말리아내전   해적    41600    11
16 2010-05-23            킹스톤불안   마약     1500     2
17 2011-02-15            리비아내전   내란    37000    21
18 2011-03-15            시리아내전   내란   144600    13
19 2011-06-17    레바논에서의시리아내전파급   내란    13500    19
20 2012-01-16           북부말리전쟁   테러    24764    57
21 2013-12-30           이라크 내전   내란   770000    22
22 2014-05-16           리비아 내전   내란   400000    19
23 2014-06-13    ISIL에대한국제군사개입   테러   472260    41
24 2014-09-16             예멘내전   내란   156000    19
25 2017-05-23            마라위위기   테러     7500     5
26 2017-12-09            이라크반란   내란   188900    13
27 2019-05-05  2019-20 페르시아만위기   민족    10000    13

In [6]:
index = 0
start_date = ls_war.loc[index,"발발시점"]
war_name = ls_war.loc[index, "갈등이름"]
start_date, war_name

(Timestamp('2001-09-11 00:00:00'), '테러와의전쟁')

In [7]:
# 발발시점 데이터 뽑기
index = 0
ls = len(ls_war["발발시점"])

# 심볼별 Historical price

In [8]:
real_df = pd.read_excel("datas/real_df.xls", "sheet")

In [9]:
# 미국상장기업 100대 기업의 historical price
real_df

,Unnamed: 0,Unnamed: 0.1,Date,Close,Open,High,Low,Volume,Change,Symbol
0,0,0,2000-01-03,1.00,0.94,1.00,0.91,535820000.0,0.0870,AAPL
1,1,1,2000-01-04,0.92,0.97,0.99,0.90,511730000.0,-0.0800,AAPL
2,2,2,2000-01-05,0.93,0.93,0.99,0.92,778320000.0,0.0109,AAPL
3,3,3,2000-01-06,0.85,0.95,0.96,0.85,767980000.0,-0.0860,AAPL
4,4,4,2000-01-07,0.89,0.86,0.90,0.85,460730000.0,0.0471,AAPL
...,...,...,...,...,...,...,...,...,...,...
358741,358741,358741,2021-03-19,1516.34,1502.63,1516.34,1502.53,22010.0,0.0225,DHR_pa
358742,358742,358742,2021-03-22,1530.53,1510.10,1530.54,1510.10,960.0,0.0094,DHR_pa
358743,358743,358743,2021-03-23,1533.00,1533.00,1533.00,1533.00,3480.0,0.0016,DHR_pa
358744,358744,358744,2021-03-24,1512.42,1512.45,1512.45,1512.42,1230.0,-0.0134,DHR_pa
358745,358745,358745,2021-03-25,1496.00,1492.90,1496.00,1492.90,650.0,-0.0109,DHR_pa

In [10]:
# 원데이터의 Date 컬럼을 Date 형으로 변환

In [11]:
real_df['Date'] = pd.to_datetime(real_df['Date'], format='%Y-%m-%d')
real_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 358746 entries, 0 to 358745
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    358746 non-null  int64
 1   Unnamed: 0.1  358746 non-null  int64
 2   Date          358746 non-null  datetime64[ns]
 3   Close         358746 non-null  float64
 4   Open          358746 non-null  float64
 5   High          358746 non-null  float64
 6   Low           358746 non-null  float64
 7   Volume        358746 non-null  float64
 8   Change        358746 non-null  float64
 9   Symbol        358746 non-null  object
dtypes: datetime64[ns](1), float64(6), int64(2), object(1)
memory usage: 27.4+ MB

In [ ]:
#test = start_date+timedelta(days=-1)
#test

In [ ]:
#real_df.loc[425, "Date"]

In [ ]:
# 리스트에서 심볼을 을 출력하는 코딩 테스트

In [12]:
symbol = real_df.groupby('Symbol').size()
symbol = pd.DataFrame(symbol).reset_index()
symbol.loc[10, "Symbol"]

'AVGO'

In [13]:
# 전쟁ID 0과 전쟁ID 1 사이의 특정 종목의 historical price 추출하는 코드
# 출력결과 index 0 row 값이 전쟁ID 0번을 전쟁발발시점으로 간주
# 전쟁ID 0번의 'Unnamed: 0' 번의 값으로 이후 코딩에서 직전 5일, 이후2일에 대한 값 탐색

In [143]:
index=1 # 전쟁ID 0~26
s_i=82 # Symbol ID 0~99

symbol = real_df.groupby('Symbol').size()
symbol = pd.DataFrame(symbol).reset_index()
ticker = symbol.loc[s_i, "Symbol"]


start_date = ls_war.loc[index,"발발시점"]
and_date = ls_war.loc[index+1,"발발시점"]
test1 = real_df[real_df['Symbol']==ticker]

# 조건설정
a = test1['Date']>=start_date
b = test1['Date']<and_date

test2 = test1.loc[a & b].reset_index()
#test2.loc[0, "Date"] # 날짜확인
num = test2.loc[0, "Unnamed: 0"] #row id 추출

In [144]:
test2

,index,Unnamed: 0,Unnamed: 0.1,Date,Close,Open,High,Low,Volume,Change,Symbol
0,47226,47226,47226,2002-01-15,12.19,12.33,12.57,12.10,6650000.0,-0.0041,TSM
1,47227,47227,47227,2002-01-16,11.67,11.86,11.90,11.63,10110000.0,-0.0427,TSM
2,47228,47228,47228,2002-01-17,12.16,11.93,12.25,11.79,7850000.0,0.0420,TSM
3,47229,47229,47229,2002-01-18,11.82,11.90,12.08,11.73,7910000.0,-0.0280,TSM
4,47230,47230,47230,2002-01-22,11.88,12.10,12.20,11.82,8680000.0,0.0051,TSM
...,...,...,...,...,...,...,...,...,...,...,...
178,47404,47404,47404,2002-09-30,4.69,4.59,4.69,4.50,10760000.0,-0.0021,TSM
179,47405,47405,47405,2002-10-01,4.82,4.69,4.86,4.58,7710000.0,0.0277,TSM
180,47406,47406,47406,2002-10-02,4.61,4.62,4.72,4.53,13910000.0,-0.0436,TSM
181,47407,47407,47407,2002-10-03,4.35,4.45,4.45,4.25,7190000.0,-0.0564,TSM
182,47408,47408,47408,2002-10-04,4.27,4.38,4.41,4.24,4870000.0,-0.0184,TSM

In [145]:
# 전쟁발발기점에서의 'Unnamed: 0'의 값
num

47226

In [146]:
# 해당값을 출력해보면 전쟁 특정종목의 N번째 전쟁발발시점의 값이 출력됨
test2[test2["Unnamed: 0"] == num]

,index,Unnamed: 0,Unnamed: 0.1,Date,Close,Open,High,Low,Volume,Change,Symbol
0,47226,47226,47226,2002-01-15,12.19,12.33,12.57,12.1,6650000.0,-0.0041,TSM

In [147]:
# num값을 기준으로 이전 5번째, 이후 2번째 범위내의 historical price 출력

In [148]:
real_df.loc[num-5:num+2]

,Unnamed: 0,Unnamed: 0.1,Date,Close,Open,High,Low,Volume,Change,Symbol
47221,47221,47221,2002-01-08,13.10,12.69,13.11,12.52,9280000.0,0.0339,TSM
47222,47222,47222,2002-01-09,13.11,13.24,13.54,12.77,10370000.0,0.0008,TSM
47223,47223,47223,2002-01-10,12.50,13.00,13.00,12.50,7210000.0,-0.0465,TSM
47224,47224,47224,2002-01-11,12.46,12.37,12.70,12.35,6110000.0,-0.0032,TSM
47225,47225,47225,2002-01-14,12.24,12.46,12.57,12.24,4240000.0,-0.0177,TSM
47226,47226,47226,2002-01-15,12.19,12.33,12.57,12.10,6650000.0,-0.0041,TSM
47227,47227,47227,2002-01-16,11.67,11.86,11.90,11.63,10110000.0,-0.0427,TSM
47228,47228,47228,2002-01-17,12.16,11.93,12.25,11.79,7850000.0,0.0420,TSM

In [175]:
new_df = pd.DataFrame(real_df.loc[num]).transpose()

In [176]:
# new_df에서 Unnamed:0.1, Close, Open, High, Low,Volume Drop

In [177]:
new_df = new_df.drop(["Unnamed: 0.1", "Close", "Open", 'High', 'Low', 'Volume'], axis=1)

In [178]:
# 지난 5일간 Average change 구하기

In [179]:
avg_change = real_df.loc[num-5:num-1, 'Change']
avg_change = round(np.mean(avg_change), 3)
avg_change

-0.007

In [180]:
# Average change 컬럼추가

In [181]:
new_df["Avg_change"] = avg_change

In [182]:
new_df

      Unnamed: 0       Date  Change Symbol  Avg_change
47226      47226 2002-01-15 -0.0041    TSM      -0.007

In [183]:
# Change index 컬럼추가

In [184]:
Change_idx = (new_df["Change"] / new_df["Avg_change"]) * 100
Change_idx = round(Change_idx.astype(float),0)
Change_idx

47226    59.0
dtype: float64

In [185]:
new_df['Change_idx'] = Change_idx
new_df

      Unnamed: 0       Date  Change Symbol  Avg_change  Change_idx
47226      47226 2002-01-15 -0.0041    TSM      -0.007        59.0

In [186]:
# Change index의 절대값 컬럼 추가

In [188]:
Abs_idx = abs(Change_idx)
Abs_idx

47226    59.0
dtype: float64

In [190]:
Abs_idx = abs(Change_idx)
Abs_idx = round(Abs_idx.astype(float),0)
#Abs_idx = Abs_idx.values
Abs_idx

47226    59.0
dtype: float64

In [191]:
new_df['Abs_idx'] = Abs_idx
new_df

      Unnamed: 0       Date  Change Symbol  Avg_change  Change_idx  Abs_idx
47226      47226 2002-01-15 -0.0041    TSM      -0.007        59.0     59.0

In [192]:
# 발발시점, 전쟁이름, 참전국수,

In [193]:
start_date = ls_war.loc[index,"발발시점"]
war_name = ls_war.loc[index, "갈등이름"]
count_country = ls_war.loc[index, "참전국수"]

start_date, war_name, count_country

(Timestamp('2002-01-15 00:00:00'), '영원한자유작전-필리핀', 2)

In [194]:
industry = df_3[df_3["Symbol"] == ticker] # ticker는 위에 정의되어 있음
industry = industry["Industry"]
industry = industry.values
industry

array(['반도체 및 반도체 장비'], dtype=object)

In [195]:
new_df['Start_date'] = start_date
new_df['War_name'] = war_name
new_df['Count_country'] = count_country
new_df['Industry'] = industry

In [196]:
new_df

,Unnamed: 0,Date,Change,Symbol,Avg_change,Change_idx,Abs_idx,Start_date,War_name,Count_country,Industry
47226,47226,2002-01-15,-0.0041,TSM,-0.007,59.0,59.0,2002-01-15,영원한자유작전-필리핀,2,반도체 및 반도체 장비

In [ ]:
# 이제 for문 돌려서 하나의 100개의 데이터를 하나의 data로 만들어야함 row 2700개 예상

In [ ]:
#### 값이 없는 간 해당연도,월,일범위 내에서 종목의 historical price 정보가 없는 거라고 보면 되구요.

In [ ]:
# 이후 분석해볼 거는,

In [ ]:
# 1. 단순히 항목을 넣어서 전쟁규모, 참전국수 등에 따른 평가지표절대값의 상관관계

In [ ]:
# 2. 전쟁종류 등에 따라 100대 기업 중 절대값 200이상되는 symbol의 기준 등

----------------------------